In [1]:
import numpy as np
import pandas as pd 
from pandas import Series,DataFrame

In [3]:
animal = DataFrame(np.arange(16).reshape(4,4),
                  columns=['W','X','Y','Z'],
                  index=['Dog','Cat','Mouse','Bird'])

In [5]:
animal

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Mouse   8   9  10  11
Bird   12  13  14  15

In [7]:
animal.loc[['Cat','Mouse'],['X','Y']]=np.nan

In [9]:
animal

        W     X     Y   Z
Dog     0   1.0   2.0   3
Cat     4   NaN   NaN   7
Mouse   8   NaN   NaN  11
Bird   12  13.0  14.0  15

In [11]:
animal.loc[['Dog'],['X']]=np.nan

In [35]:
behavior_map= {'W':'Good','X':'Bad','Y':'Good','Z':'Bad'}

# "T" is used to specify the axis as axis = 0
animal_col = animal.T.groupby(behavior_map)

In [37]:
animal_col

In [39]:
animal_col.sum()

      Dog  Cat  Mouse  Bird
Bad   3.0  7.0   11.0  28.0
Good  2.0  4.0    8.0  26.0

In [43]:
behave_series = Series(behavior_map)
behave_series

W    Good
X     Bad
Y    Good
Z     Bad
dtype: object

In [47]:
animal.T.groupby(behave_series).count()

      Dog  Cat  Mouse  Bird
Bad     1    1      1     2
Good    2    1      1     2

In [49]:
animal

        W     X     Y   Z
Dog     0   NaN   2.0   3
Cat     4   NaN   NaN   7
Mouse   8   NaN   NaN  11
Bird   12  13.0  14.0  15

In [51]:
animal.groupby(len).sum()

    W     X     Y   Z
3   4   0.0   2.0  10
4  12  13.0  14.0  15
5   8   0.0   0.0  11

In [53]:
keys=['A','B','A','B']
animal.groupby([len,keys]).max()

      W     X     Y   Z
3 A   0   NaN   2.0   3
  B   4   NaN   NaN   7
4 B  12  13.0  14.0  15
5 A   8   NaN   NaN  11

In [55]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]],names=['City','sub_value'])

In [59]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)

In [61]:
dframe_hr = dframe_hr*100

In [63]:
dframe_hr

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400